In [1]:
import pandas as pd

In [2]:
days = pd.Series(["Monday", "Tuesday", "Wednesday"])
days

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [3]:
import numpy as np

fruit = np.array(["lemon", "lime", "pineapple"])
fruit_series = pd.Series(fruit)
fruit_series

0        lemon
1         lime
2    pineapple
dtype: object

In [6]:
fruit_2 = pd.Series(["lemon", "lime", "pineapple"], index=["a", "b", "c"])
fruit_2

a        lemon
b         lime
c    pineapple
dtype: object

In [9]:
fruit_2["b"]

'lime'

Series are single dimensional

Dataframes are multi-dimensional

In [10]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [25]:
df_dict = {"Country":["Ghana", "Kenya", "Togo"],
           "Capital":["Accra", "Nairobi", "Lome"],
           "Population":[1000, 2000, 3000]}

df = pd.DataFrame(df_dict, index=[2, 4, 6])

In [26]:
df

  Country  Capital  Population
2   Ghana    Accra        1000
4   Kenya  Nairobi        2000
6    Togo     Lome        3000

In [27]:
df.loc[2] #Selects given dataframe index

Country       Ghana
Capital       Accra
Population     1000
Name: 2, dtype: object

In [28]:
df.iloc[2] #Selects regular index

Country       Togo
Capital       Lome
Population    3000
Name: 6, dtype: object

In [29]:
df.at[6, 'Country'] #Get data with index and column name

'Togo'

In [30]:
df.iat[2, 1] #Get data with row and column coordinate

'Lome'

In [32]:
df["Population"].sum()

6000

In [39]:
df["Population"].mean()

2000.0

In [40]:
df_dict2 = {"Name": ["Mat", "Usain", "James", np.nan],
            "Age": [23, 26, 31, 30],
            "Profession": ["Data Scientist", "Sprinter", np.nan, "Chef"],
            "Height": [np.nan, 175, 180, 177]}

df_2 = pd.DataFrame(df_dict2)

In [41]:
df_2

    Name  Age      Profession  Height
0    Mat   23  Data Scientist     NaN
1  Usain   26        Sprinter   175.0
2  James   31             NaN   180.0
3    NaN   30            Chef   177.0

In [43]:
df_2.isnull()

    Name    Age  Profession  Height
0  False  False       False    True
1  False  False       False   False
2  False  False        True   False
3   True  False       False   False

In [48]:
df_2.isna()

    Name    Age  Profession  Height
0  False  False       False    True
1  False  False       False   False
2  False  False        True   False
3   True  False       False   False

In [49]:
df_2.dropna()

    Name  Age Profession  Height
1  Usain   26   Sprinter   175.0